Hello there!
After last provider update, provided manifest will produce following result:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # sbercloud_obs_bucket.test467321482 will be created
  + resource "sbercloud_obs_bucket" "test467321482" {
      + acl                   = "private"
      + bucket                = "test2143245"
      + bucket_domain_name    = (known after apply)
      + bucket_version        = (known after apply)
      + encryption            = false
      + enterprise_project_id = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + kms_key_project_id    = (known after apply)
      + multi_az              = false
      + policy                = (known after apply)
      + policy_format         = "obs"
      + quota                 = 0
      + region                = (known after apply)
      + sse_algorithm         = (known after apply)
      + storage_class         = "STANDARD"
      + storage_info          = (known after apply)
      + user_domain_names     = (known after apply)
      + versioning            = false

      + lifecycle_rule {
          + enabled = true
          + name    = "test"

          + expiration {
              + days = 7
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
Please, check that your problem is resolved and close this issue.